/****************************************Copyright (c)****************************************************
**                             成 都 世 纪 华 宁 科 技 有 限 公 司
**                                http://www.huaning-iot.com
**                                http://hichard.taobao.com
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           lwip_pppos.h
** Last modified Date:  2017-11-02
** Last Version:        v1.00
** Description:         lwip通过GPRS拨号的PPPOS应用
**--------------------------------------------------------------------------------------------------------
** Created By:          Renhaibo
** Created date:        2017-11-02
** Version:             v1.00
** Descriptions:        
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
** Version:             
** Description:         
*********************************************************************************************************/
#ifndef __LWIP_PPPOS_H__
#define __LWIP_PPPOS_H__

#ifdef __cplusplus
extern "C" {
#endif
  
#include <stdint.h>
#include <rtthread.h>
  
 
/*********************************************************************************************************
**  基本配置
*********************************************************************************************************/
#define PPPOS_DEBUG             1     // 是否使能调试功能输出
#define AT_TRY_NUM              20    // AT指令重试次数
#define PPP_TRY_NUM             3     // PPP重新连接重试次数
#define PPP_DNS_REQ             0     // 是否ppp协商DNS
#define PPP_NETIF_DEFAULT       1     // 是否设置PPP网卡为默认网卡

/*********************************************************************************************************
**  联网状态灯控制
*********************************************************************************************************/
#define ppp_net_on()            rt_hw_led_on(1)
#define ppp_net_off()           rt_hw_led_off(1)
 
/*********************************************************************************************************
**  pppos设备注册初始化
*********************************************************************************************************/
extern int lwip_pppos_init(const char *tty_name,  
                         void(*power_ctrl)(void), 
                         int(*modem_at_dial)(rt_device_t handle,uint8_t *buffer,const char *apn_name), 
                         const char *apn_name,const char * user_name, const char *user_password);
  
#ifdef __cplusplus
}
#endif      // __cplusplus

#endif      // __LWIP_PPPOS_H__
/*********************************************************************************************************
END FILE
*********************************************************************************************************/
