/****************************************Copyright (c)****************************************************
**                             成 都 世 纪 华 宁 科 技 有 限 公 司
**                                http://www.huaning-iot.com
**                                http://hichard.taobao.com
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           lwip_radio802154.h
** Last modified Date:  2015-01-09
** Last Version:        v1.00
** Description:         lwip的IEEE 802.15.4的射频驱动应用框架
**--------------------------------------------------------------------------------------------------------
** Created By:          Renhaibo
** Created date:        2015-01-09
** Version:             v1.00
** Descriptions:        
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
** Version:             
** Description:         
*********************************************************************************************************/
#ifndef __LWIP_RADIO802154_H__
#define __LWIP_RADIO802154_H__

#ifdef __cplusplus
extern "C" {
#endif

#include <rtthread.h>
#include "netif/radio/lowpan_if.h"

/*********************************************************************************************************
**  定义6LoWPAN驱动框架结构
*********************************************************************************************************/
struct lowpan_device
{
	/* inherit from rt_device */
	struct rt_device parent;

	/* network interface for lwip 6lowpan radio */
	struct lowpanif lowpanif;
};

/*********************************************************************************************************
**  实现的外部函数声明
*********************************************************************************************************/
rt_err_t lowpan_device_ready(struct lowpan_device* dev);
rt_err_t lowpan_device_init(struct lowpan_device * dev, const char *name);


#ifdef __cplusplus
    }
#endif      // __cplusplus
    
#endif      // __LWIP_RADIO802154_H__
/*********************************************************************************************************
END FILE
*********************************************************************************************************/
