/****************************************Copyright (c)****************************************************
**                             成 都 世 纪 华 宁 科 技 有 限 公 司
**                                http://www.huaning-iot.com
**                                http://hichard.taobao.com
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           arch_io_devinfo.h
** Last modified Date:  2017-10-01
** Last Version:        v1.0
** Description:         芯片电气信息获取功能函数实现
**
**--------------------------------------------------------------------------------------------------------
** Created By:          Renhaibo任海波
** Created date:        2017-10-01
** Version:             v1.0
** Descriptions:        The original version 初始版本
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Description:
**
*********************************************************************************************************/
#include "hal/arch/inc/arch_io_memmap.h"
#include "hal/arch/inc/arch_io_reg.h"
#include "hal/arch/inc/arch_io_devinfo.h"

/*********************************************************************************************************
  局部变量定义
*********************************************************************************************************/


/*********************************************************************************************************
** Function name:       device_info_uid_get
** input parameters:    获取芯片的设备ID
**                      uid         获取到的设备ID存储地址
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
void device_info_uid_get(rt_uint32_t *uid)
{
  uid[0] = HWREG32(UID_BASE + UID0);
  uid[1] = HWREG32(UID_BASE + UID1);
  uid[2] = HWREG32(UID_BASE + UID2);
}

/*********************************************************************************************************
** Function name:       device_flash_size_get
** input parameters:    获取芯片的 片内flash大小
** output parameters:   NONE
** Returned value:      获取到的大小，以KB为单位
*********************************************************************************************************/
rt_uint32_t device_flash_size_get(void)
{
    return HWREG32(FLASH_SIZE);
}

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
