/****************************************Copyright (c)****************************************************
**                             成 都 世 纪 华 宁 科 技 有 限 公 司
**                                http://www.huaning-iot.com
**                                http://hichard.taobao.com
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           lwip_telnet.h
** Last modified Date:  2015-06-23
** Last Version:        v1.00
** Description:         lwip的telnet服务器实现，采用telnet用作finish的shell接口
**--------------------------------------------------------------------------------------------------------
** Created By:          Renhaibo
** Created date:        2015-06-23
** Version:             v1.00
** Descriptions:        
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
** Version:             
** Description:         
*********************************************************************************************************/
#ifndef __LWIP_TELNET_H__
#define __LWIP_TELNET_H__

#ifdef __cplusplus
extern "C" {
#endif



#ifdef __cplusplus
    }
#endif      // __cplusplus
    
#endif      // __LWIP_TELNET_H__
/*********************************************************************************************************
END FILE
*********************************************************************************************************/
