/****************************************Copyright (c)****************************************************
**                             成 都 世 纪 华 宁 科 技 有 限 公 司
**                                http://www.huaning-iot.com
**                                http://hichard.taobao.com
**
**
**--------------File Info--------------------------------------------------------------------------------

** File Name:               rhb_CRC.h
** Last modified Date:      2010-8-3
** Last Version:            v1.0
** Description:             软件CRC校验算法函数声明头文件
** 
**--------------------------------------------------------------------------------------------------------
** Created By:              Renhaibo任海波
** Created date:            2010-8-8
** Version:                 v1.0
** Descriptions:            The original version 初始版本
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Description:
**
*********************************************************************************************************/
#ifndef _RHB_CRC_H__
#define _RHB_CRC_H__

#ifdef __cplusplus
extern "C" {
#endif

/*********************************************************************************************************
** 需要的头文件声明
*********************************************************************************************************/
#include <rtthread.h>

/*********************************************************************************************************
** 外部函数的声明
*********************************************************************************************************/
extern rt_uint16_t rhb_CRC16(rt_uint8_t *pu8Msg, rt_uint32_t u32Len, rt_uint16_t CRC16);
extern rt_uint16_t rhb_ITU_CRC16(rt_uint8_t *pu8Msg, rt_uint32_t u32Len, rt_uint16_t CRC16);
extern rt_uint32_t rhb_CRC32(rt_uint8_t *pu8Msg, rt_uint32_t u32Len, rt_uint32_t CRC32);
extern rt_uint32_t rhb_ethernet_CRC32(rt_uint8_t *pu8Msg, rt_uint32_t u32Len, rt_uint32_t CRC32);


#ifdef __cplusplus
}
#endif

#endif // endif of _RHB_CRC_H__
/*********************************************************************************************************
  END FILE 
*********************************************************************************************************/
